# NumberingSchemaTypes.StructuralNumberingSchemas Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumberingSchemaTypes..::..StructuralNumberingSchemas Class
NumberingSchemaTypes Class Members See Also
---
A collection of types of built-in Numbering Schemas that are used for numbering structure elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static class StructuralNumberingSchemas
```

Visual Basic
---
```text
Public NotInheritable Class StructuralNumberingSchemas
```

Visual C++
---
```text
public ref class StructuralNumberingSchemas abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..NumberingSchemaTypes..::..StructuralNumberingSchemas
# See Also
NumberingSchemaTypes..::..StructuralNumberingSchemas Members
Autodesk.Revit.DB Namespace